package lesson5;

import kotlin.NotImplementedError;

import java.util.ArrayList;
import java.util.HashSet;
import java.util.List;
import java.util.Set;

@SuppressWarnings("unused")
public class JavaGraphTasks {
    /**
     * Эйлеров цикл.
     * Средняя
     *
     * Дан граф (получатель). Найти по нему любой Эйлеров цикл.
     * Если в графе нет Эйлеровых циклов, вернуть пустой список.
     * Соседние дуги в списке-результате должны быть инцидентны друг другу,
     * а первая дуга в списке инцидентна последней.
     * Длина списка, если он не пуст, должна быть равна количеству дуг в графе.
     * Веса дуг никак не учитываются.
     *
     * Пример:
     *
     *      G -- H
     *      |    |
     * A -- B -- C -- D
     * |    |    |    |
     * E    F -- I    |
     * |              |
     * J ------------ K
     *
     * Вариант ответа: A, E, J, K, D, C, H, G, B, C, I, F, B, A
     *
     * Справка: Эйлеров цикл -- это цикл, проходящий через все рёбра
     * связного графа ровно по одному разу
     */
    public static List<Graph.Edge> findEulerLoop(Graph graph) {


        List<Graph.Vertex> res = new ArrayList<>();
        find(graph, graph.get("A"), res);


        List<Graph.Edge> edges = new ArrayList<>();
        for (int i = 0; i < res.size() - 1; i++) {
            edges.add(graph.getConnection(res.get(0), res.get(1)));
        }
        System.out.println(edges);
        return edges;
    }

    private static void find(Graph graph, Graph.Vertex vertex, List<Graph.Vertex> result) {
        for (Graph.Edge edge : graph.getEdges()) {
            if (edge.getBegin().getName().equals(vertex.getName())) {
                graph.getVertices().remove(edge.getBegin());
                graph.getVertices().remove(edge.getEnd());
                find(graph, edge.getEnd(), result);
            }
        }
        result.add(vertex);
    }

    /**
     * Минимальное остовное дерево.
     * Средняя
     *
     * Дан граф (получатель). Найти по нему минимальное остовное дерево.
     * Если есть несколько минимальных остовных деревьев с одинаковым числом дуг,
     * вернуть любое из них. Веса дуг не учитывать.
     *
     * Пример:
     *
     *      G -- H
     *      |    |
     * A -- B -- C -- D
     * |    |    |    |
     * E    F -- I    |
     * |              |
     * J ------------ K
     *
     * Ответ:
     *
     *      G    H
     *      |    |
     * A -- B -- C -- D
     * |    |    |
     * E    F    I
     * |
     * J ------------ K
     */
    public static Graph minimumSpanningTree(Graph graph) {
        throw new NotImplementedError();
    }

    /**
     * Максимальное независимое множество вершин в графе без циклов.
     * Сложная
     *
     * Дан граф без циклов (получатель), например
     *
     *      G -- H -- J
     *      |
     * A -- B -- D
     * |         |
     * C -- F    I
     * |
     * E
     *
     * Найти в нём самое большое независимое множество вершин и вернуть его.
     * Никакая пара вершин в независимом множестве не должна быть связана ребром.
     *
     * Если самых больших множеств несколько, приоритет имеет то из них,
     * в котором вершины расположены раньше во множестве this.vertices (начиная с первых).
     *
     * В данном случае ответ (A, E, F, D, G, J)
     *
     * Эта задача может быть зачтена за пятый и шестой урок одновременно
     */
    public static Set<Graph.Vertex> largestIndependentVertexSet(Graph graph) {
        List<Set<Graph.Vertex>> allResults = new ArrayList<>();

        for (Graph.Vertex vertex : graph.getVertices()) {

            Set<Graph.Vertex> candidates = new HashSet<>();
            Set<Graph.Vertex> exists = new HashSet<>();

            for (Graph.Vertex anotherVertex : graph.getVertices()) {
                if (!graph.getNeighbors(vertex).contains(anotherVertex) &&
                        !exists.contains(anotherVertex)) {
                    exists.addAll(graph.getNeighbors(anotherVertex));
                    candidates.add(anotherVertex);
                }
            }
            allResults.add(candidates);
        }

        Set<Graph.Vertex> result = new HashSet<>();

        for (int i = 0, allResultsSize = allResults.size(); i < allResultsSize; i++) {
            Set<Graph.Vertex> subRes = allResults.get(i);
            if (result.size() < subRes.size()) {
                result = subRes;
            }
        }

        return result;
    }

    /**
     * Наидлиннейший простой путь.
     * Сложная
     *
     * Дан граф (получатель). Найти в нём простой путь, включающий максимальное количество рёбер.
     * Простым считается путь, вершины в котором не повторяются.
     * Если таких путей несколько, вернуть любой из них.
     *
     * Пример:
     *
     *      G -- H
     *      |    |
     * A -- B -- C -- D
     * |    |    |    |
     * E    F -- I    |
     * |              |
     * J ------------ K
     *
     * Ответ: A, E, J, K, D, C, H, G, B, F, I
     */
    public static Path longestSimplePath(Graph graph) {
        throw new NotImplementedError();
    }
}
